#define _CRT_SECURE_NO_WARNINGS 1
#include <stdio.h>
#include <string.h>

//操作符

//算数操作符
//+ - * / %

//移位操作符
//>> << 

//位操作符:& | ^
//&按位与
//按位或
//按位异或

//赋值操作符
//= += -= *= /= &/ ^= |= >>= <<=

//单目操作符 (a+b中的+有两个操作数，为双目操作符)
//! - + & sizeof ~ -- ++ * (类型)

//关系操作符
// > >= < <= != ==

//逻辑操作符
//&&（且）||（或）

//条件操作符(三目操作符):三个操作数
//exp1?exp2:exp3
//exp1如果成立，exp2计算，整个表达式的结果是：exp2的结果
//exp1不成立，exp3计算，整个表达式的结果是：exp3的结果

//逗号表达式
// 逗号隔开的一串表达式

//下标引用 函数调用和结构成员
//[] () . ->


//// /为除法操作符
//int main()
//{
//	//int a = 9 / 2;
//	//float a = 9 / 2;
//	//float a = 9 / 2.0;//除数为小数才有小数的除法运算
//	int a = 9 % 2;//%取模（余）
//	printf("%d\n", a);
//	return 0;
//}

////左移操作符
//int main()
//{
//	int a = 2;
//	int b = a << 1;
//	//左移操作符移动的是二进制位
//	printf("%d\n", b);
//	return 0;
//}

////赋值操作符
//int main()
//{
//	int a = 2;
//	a = a + 5;
//	a += 5;
//
//	a = a - 3;
//	a -= 3;
//
//	printf("%d\n", a);
//	return 0;
//}


////单目操作符号
//int main()
//{
//	//0为假，非0为真
//	int a = 10;
//	printf("%d\n", !a);
//
//	if(a)
//	{
//		//如果a为真往后执行
//	}
//	
//	if (!a)
//	{
//		//如果a为假往后执行
//	}
//	return 0;
//}


////sizeof是一个操作符
////计算类型或者变量的大小
//int main()
//{	
//	int a = 10;
//	printf("%d\n", sizeof(int));
//	printf("%d\n", sizeof(a));
//	printf("%d\n", sizeof a );
//	//sizeof 后括号可以省略 证明它不是函数
//
//	return 0;
//}

////sizeof计算数组大小
//int main()
//{
//	int arr[10] = { 0 };
//	printf("%d\n", sizeof(arr));//计算的是数组的总大小 单位是字节
//	printf("%d\n", sizeof(arr[0]));//4
//	int sz = sizeof(arr) / sizeof(arr[0]);//计算元素个数
//	printf("%d\n", sz);
//
//	return 0;
//}



////~按位取反
//int main()
//{
//	int a = 0;
//	printf("%d\n",~ a);
//	//按二进制位取反(把所有二进制中的数字),1变成0，0变成1
//	//整数在内存中存储的是补码
//	
//	//一个负整数的二进制表示有三种：原码 反码 补码
//	//-1的原码：10000000000000000000000000000001（第一个1为符号位，1代表负）
//	//按位取反：11111111111111111111111111111110（符号位不变）（反码）
//	//反码加1为补码：11111111111111111111111111111111
//
//	return 0;
//}


////-- ++
//int main()
//{
//	//int a = 10;
//	//int b = a++;//后置++ （先使用 后++）
//
//	//printf("%d\n", b);//10
//	//printf("%d\n", a);//11
//
//
//	//int a = 10;
//	//int b = ++a;//前置++ （先++ 后使用）
//
//	//printf("%d\n", b);//11
//	//printf("%d\n", a);//11
//
//	return 0;
//}



////（类型） 强制类型转换
//int main()
//{
//	//强制类型转换
//	int a = (int)3.14;//右到左丢失精度
//	printf("%d\n", a);
//	return 0;
//}


////逻辑操作符
//int main()
//{
//	int a = 3;
//	int b = 5;
//	if (a && b)
//	{
//		printf("%d\n", 1);
//	}
//	return 0;
//}


////条件操作符
//int main()
//{
//	int a = 0;
//	int b = 3;
//	int max = 0;
//
//	/*if (a > b)
//		max = a;
//	else
//		max = b;*/
//
//	max = a > b ? a : b;
//	printf("%d\n", max);
//	return 0;
//}


////逗号表达式
//int main()
//{
//	(2, 4 + 5, 6);
//	int a = 0;
//	int b = 3;
//	int c = 5;
//	int d = (a = b + 2, c = a - 4, b = c + 2);
//	//从左向右依次计算，结果为最后一个表达式结果
//	printf("%d\n", d);
//	return 0;
//}


////下标引用[]
//int main()
//{
//	int arr[10] = { 1,2,3,4,5,6,7,8,9,10 };
//	printf("%d\n", arr[5]);//下标引用
//
//	return 0;
//}

////函数调用（）
//int main()
//{
//	printf("hehe\n");
//	//()即为函数调用操作符
//
//	return 0;
//}


//& * . ->